Applying **prod**:
```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/african-cities-conference-prod/runs/run-sHZwg1dp1ASMyegQ

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.base: Reading...
data.terraform_remote_state.base: Read complete after 1s
module.app.data.digitalocean_domain.domain: Reading...
module.app.github_repository_environment.env: Refreshing state... [id=african-cities-conference:prod]
module.app.digitalocean_droplet.droplet: Refreshing state... [id=344423150]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Refreshing state... [id=african-cities-conference:prod:prod_traefik]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Refreshing state... [id=african-cities-conference:prod:prod_django]
module.app.github_actions_environment_secret.tfvars["prod_postgres"]: Refreshing state... [id=african-cities-conference:prod:prod_postgres]
module.app.data.digitalocean_domain.domain: Read complete after 0s [id=africancitieslab.org]
module.app.digitalocean_spaces_bucket.bucket: Refreshing state... [id=african-cities-conference-prod]
module.app.github_actions_environment_secret.droplet_host: Refreshing state... [id=african-cities-conference:prod:droplet_host]
module.app.digitalocean_record.a: Refreshing state... [id=365734239]
module.app.digitalocean_project_resources.resources: Refreshing state... [id=721e1f6b-b380-4973-856d-754699776edc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.github_actions_environment_secret.tfvars["prod_django"] must be replaced
-/+ resource "github_actions_environment_secret" "tfvars" {
      ~ created_at      = "2023-03-08 12:08:26 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-conference:prod:prod_django" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-08 12:08:26 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.app.github_actions_environment_secret.tfvars["prod_traefik"] must be replaced
-/+ resource "github_actions_environment_secret" "tfvars" {
      ~ created_at      = "2023-03-08 12:08:24 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-conference:prod:prod_traefik" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-08 12:08:24 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.


```
```
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/african-cities-conference-prod/runs/run-x2WRQSfevn8HvrBT

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.base: Reading...
data.terraform_remote_state.base: Read complete after 1s
module.app.data.digitalocean_domain.domain: Reading...
module.app.github_repository_environment.env: Refreshing state... [id=african-cities-conference:prod]
module.app.digitalocean_droplet.droplet: Refreshing state... [id=344423150]
module.app.github_actions_environment_secret.tfvars["prod_postgres"]: Refreshing state... [id=african-cities-conference:prod:prod_postgres]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Refreshing state... [id=african-cities-conference:prod:prod_django]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Refreshing state... [id=african-cities-conference:prod:prod_traefik]
module.app.data.digitalocean_domain.domain: Read complete after 0s [id=africancitieslab.org]
module.app.digitalocean_spaces_bucket.bucket: Refreshing state... [id=african-cities-conference-prod]
module.app.github_actions_environment_secret.droplet_host: Refreshing state... [id=african-cities-conference:prod:droplet_host]
module.app.digitalocean_record.a: Refreshing state... [id=365734239]
module.app.digitalocean_project_resources.resources: Refreshing state... [id=721e1f6b-b380-4973-856d-754699776edc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.github_actions_environment_secret.tfvars["prod_django"] must be replaced
-/+ resource "github_actions_environment_secret" "tfvars" {
      ~ created_at      = "2023-03-08 12:08:26 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-conference:prod:prod_django" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-08 12:08:26 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.app.github_actions_environment_secret.tfvars["prod_traefik"] must be replaced
-/+ resource "github_actions_environment_secret" "tfvars" {
      ~ created_at      = "2023-03-08 12:08:24 +0000 UTC" -> (known after apply)
      ~ id              = "african-cities-conference:prod:prod_traefik" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-08 12:08:24 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.


module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Destroying... [id=african-cities-conference:prod:prod_traefik]
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Destruction complete after 1s
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Creating...
module.app.github_actions_environment_secret.tfvars["prod_django"]: Destruction complete after 2s
module.app.github_actions_environment_secret.tfvars["prod_django"]: Creating...
module.app.github_actions_environment_secret.tfvars["prod_traefik"]: Creation complete after 5s [id=african-cities-conference:prod:prod_traefik]
module.app.github_actions_environment_secret.tfvars["prod_django"]: Creation complete after 4s [id=african-cities-conference:prod:prod_django]

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.

Outputs:

droplet_host = "164.92.251.174"

```